---
kind: method
id: M:Autodesk.Revit.DB.Structure.StructuralConnectionHandlerType.IsGeneric
source: html/697a72c2-a01f-4203-db5c-c3c95d44261e.htm
---
# Autodesk.Revit.DB.Structure.StructuralConnectionHandlerType.IsGeneric Method

Checks if StructuralConnectionHandlerType is generic.

## Syntax (C#)
```csharp
public bool IsGeneric()
```

## Returns
True if StructuralConnectionHandlerType is generic.